# ==============================================================================
# Brewfile
#
# System Default Terminal Tools
#
# Quickstart:

# $ brew bundle
# ==============================================================================

# Homebrew: Tap ================================================================
tap "homebrew/dupes"
tap "homebrew/core"
tap "homebrew/php"
tap "homebrew/bundle"
tap "homebrew/services"
tap "drone/drone"
tap "d12frosted/emacs-plus"
tap "go-delve/delve"
tap "neovim/neovim"
tap "universal-ctags/universal-ctags"
tap "nodenv/nodenv"

# Homebrew: Install ============================================================

# SHELL ------------------------------------------------------------------------

brew "bash"
brew "bash-completion"

brew "zsh"
brew "zplug"
brew "zsh-completion"

# GNU: Core --------------------------------------------------------------------

# GNU core utilities (those that come with OS X are outdated)
brew "coreutils"

# GNU awk
brew "gawk"

# GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew "findutils"

brew "gnu-sed", args: ["with-default-names"]
brew "gnu-tar", args: ["with-default-names"]
brew "gnu-which", args: ["with-default-names"]

# Install more recent versions of some OS X tools
brew "diffutils"
brew "file-formula"
brew "gzip"
brew "grep", args: ["with-default-names"]
brew "make", args: ["with-default-names"]
brew "less"
brew "openssh"
brew "rsync"
brew "screen"
brew "unzip"

# Utility ----------------------------------------------------------------------

# Language ---------------------------------------------------------------------

brew "readline"
brew "autoconf"
brew "automake"
brew "aws-elasticbeanstalk"
brew "gettext"
brew "sqlite"
brew "ccls"
brew "certbot"
brew "checkbashisms"
brew "cmake"
brew "composer"
brew "go"
brew "dep"
brew "diff-so-fancy"
brew "direnv"
brew "libgpg-error"
brew "libassuan"
brew "libgcrypt"
brew "libksba"
brew "pth"
brew "dirmngr"
brew "libtool"
brew "fontforge"
brew "fpp"
brew "fzf"
brew "git"
brew "git-extras"
brew "git-flow-avh"
brew "global"
brew "libusb"
brew "pinentry"
brew "gnupg"
brew "pkg-config"
brew "gpg-agent"
brew "jemalloc"
brew "libsass"
brew "libtermkey"
brew "libusb-compat"
brew "libuv"
brew "libvterm"
brew "libyaml"
brew "mercurial"
brew "mongodb", restart_service: true
brew "mono"
brew "msgpack"
brew "mypy"
brew "mysql"
brew "unibilium"
brew "neovim"
brew "node"
brew "node-build"
brew "nodenv"
brew "path-extractor"
brew "pipenv"
brew "pyenv"
brew "restic"
brew "ruby-build"
brew "rbenv"
brew "rbenv-bundler"
brew "redis", restart_service: true
brew "rename"
brew "ripgrep"
brew "ruby"
brew "rust"
brew "selenium-server-standalone", restart_service: true
brew "shellcheck"
brew "starship"
brew "the_silver_searcher"
brew "tidy-html5"
brew "tree"
brew "watchman"
brew "wget"
brew "yamllint"
brew "yank"
brew "drone/drone/drone"
brew "nodenv/nodenv/nodenv-default-packages"
brew "nodenv/nodenv/nodenv-package-json-engine"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
brew cask install dotnet-sdk
